<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Importing-Library" data-toc-modified-id="Importing-Library-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Importing Library</a></span></li><li><span><a href="#Reading-Data" data-toc-modified-id="Reading-Data-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Reading Data</a></span></li></ul></div>

## Importing Library

In [15]:
import pandas as pd
import numpy as np

## Reading Data

In [ ]:
title_ratings_df = pd.read_csv('data/title.ratings.tsv.gz', sep = '\t')

title_ratings_df = title_ratings_df.replace("\\N",np.nan)

In [16]:
names_df = pd.read_csv('data/name.basics.tsv.gz', sep = '\t')

names_df = names_df.replace("\\N",np.nan) 

names_df.shape

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0072308,tt0053137,tt0031983,tt0050419"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0075213,tt0038355,tt0037382,tt0117057"
2,nm0000003,Brigitte Bardot,1934,NaN,"actress,soundtrack,music_department","tt0057345,tt0049189,tt0054452,tt0056404"
3,nm0000004,John Belushi,1949,1982,"actor,soundtrack,writer","tt0078723,tt0077975,tt0072562,tt0080455"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0060827,tt0050976,tt0050986,tt0083922"
...,...,...,...,...,...,...
11366245,nm9993714,Romeo del Rosario,NaN,NaN,"animation_department,art_department","tt2455546,tt11657662"
11366246,nm9993716,Essias Loberg,NaN,NaN,NaN,NaN
11366247,nm9993717,Harikrishnan Rajan,NaN,NaN,cinematographer,tt8736744
11366248,nm9993718,Aayush Nair,NaN,NaN,cinematographer,NaN
11366249,nm9993719,Andre Hill,NaN,NaN,NaN,NaN

In [17]:
title_akas_df = pd.read_csv('data/title.akas.tsv.gz', sep = '\t')

mask = title_akas_df['titleId'].isin(title_ratings_df['tconst'])

title_akas_df = title_akas_df[mask]

title_akas_df = title_akas_df.replace("\\N",np.nan)

title_akas_df.shape

C:\Users\karteuku\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (7) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,imdbDisplay,NaN,0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0
3,tt0000001,4,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0
4,tt0000001,5,Карменсита,RU,NaN,imdbDisplay,NaN,0

In [42]:
title_basics_df = pd.read_csv('data/title.basics.tsv.gz', sep = '\t')

mask = title_basics_df['tconst'].isin(title_ratings_df['tconst'])

title_basics_df = title_basics_df[mask]

title_basics_df = title_basics_df.replace("\\N",np.nan)

title_basics_df.shape

C:\Users\karteuku\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (4,5) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

(1197139, 9)

In [43]:
len(title_basics_df['tconst'].unique())

1197139

In [19]:
title_crew_df = pd.read_csv('data/title.crew.tsv.gz', sep = '\t')

mask = title_crew_df['tconst'].isin(title_ratings_df['tconst'])

title_crew_df = title_crew_df[mask]

title_crew_df = title_crew_df.replace("\\N",np.nan)

In [36]:
title_crew_df.shape

(8538937, 3)

In [37]:
len(title_crew_df['tconst'].unique())

8538937

In [20]:
title_episode_df = pd.read_csv('data/title.episode.tsv.gz', sep = '\t')

mask = title_episode_df['tconst'].isin(title_ratings_df['tconst'])

title_episode_df = title_episode_df[mask]

title_episode_df = title_episode_df.replace("\\N",np.nan)

In [32]:
title_episode_df.shape

      tconst parentTconst seasonNumber episodeNumber
0  tt0020666   tt15180956            1             2
1  tt0020829   tt15180956            1             1
2  tt0021166   tt15180956            1             3
3  tt0021612   tt15180956            2             2
4  tt0021655   tt15180956            2             5

In [34]:
title_principals_df = pd.read_csv('data/title.principals.tsv.gz', sep = '\t')

mask = title_principals_df['tconst'].isin(title_ratings_df['tconst'])

title_principals_df = title_principals_df[mask]

title_principals_df = title_principals_df.replace("\\N",np.nan)

In [33]:
title_principals_df.shape

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,NaN,"[""Self""]"
1,tt0000001,2,nm0005690,director,NaN,NaN
2,tt0000001,3,nm0374658,cinematographer,director of photography,NaN
3,tt0000002,1,nm0721526,director,NaN,NaN
4,tt0000002,2,nm1335271,composer,NaN,NaN

In [23]:
len(title_ratings_df['tconst'].unique())

1197154

In [24]:
len(title_akas_df['titleId'].unique())

6011613

In [66]:
data = title_ratings_df.copy()

In [67]:
print(data.shape)

data = data.merge(title_crew_df, on ='tconst', how ='left')

print(data.shape)

(1197154, 3)
(1197154, 5)

In [68]:
print(data.shape)

data = data.merge(title_basics_df, on ='tconst', how ='left')

print(data.shape)

(1197154, 5)
(1197154, 13)

In [69]:
data.head()

,tconst,averageRating,numVotes,directors,writers,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,5.7,1846,nm0005690,NaN,short,Carmencita,Carmencita,0,1894,NaN,1,"Documentary,Short"
1,tt0000002,6.0,236,nm0721526,NaN,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,NaN,5,"Animation,Short"
2,tt0000003,6.5,1606,nm0721526,NaN,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,NaN,4,"Animation,Comedy,Romance"
3,tt0000004,6.0,153,nm0721526,NaN,short,Un bon bock,Un bon bock,0,1892,NaN,12,"Animation,Short"
4,tt0000005,6.2,2429,nm0005690,NaN,short,Blacksmith Scene,Blacksmith Scene,0,1893,NaN,1,"Comedy,Short"

In [ ]:
title_episode_summary = pd.pivot_table(title_episode_df, index = 'tconst', 
                                      values= ['seasonNumber','episodeNumber'], 
                                      aggfunc = np.nanmax
                                     )

title_episode_summary